import pandas as pd

# Series
# ------------------------------------
s = pd.Series( [138.3, 138.3, 139.6] )
print(s) # 自動加上以 0 為起點的 index


# ------------------------------------
etf_0050 = { '2021-07-01': 138.3,
             '2021-07-02': 138.3, 
             '2021-07-03': 139.6 }
s = pd.Series(etf_0050)
print(s) # 自己依照時間當 index


# ------------------------------------
etf_date =  [ '2021-07-01', '2021-07-02', '2021-07-03' ] # = etf_0050.keys()
etf_value = [ 138.3, 138.3, 139.6 ] # = etf_0050.values()

s = pd.Series(etf_value, etf_date)
print(s)
